; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v11 ?v4)
             (pred_8 ?v8 ?v10)
             (pred_1 ?v11 ?v10)
             (pred_6 ?v2 ?v11 )
	     (pred_5 ?v11)
             (pred_11 ?v6)
             (pred_9 ?v8)
             (pred_3 ?v10)
             (pred_2 ?v11)
             (pred_7 ?v8)
             (pred_4 ?v11)
             (pred_12 ))



(:action op_2
:parameters (?v3 ?v13 ?v7 ?v1)
:precondition (and (pred_11 ?v3) (pred_11 ?v13) (pred_9 ?v7) (pred_3 ?v1)
          (pred_10 ?v3 ?v13) (pred_8 ?v7 ?v1)
                   (pred_1 ?v13 ?v1) (pred_5 ?v3) 
                   (pred_2 ?v13) (pred_7 ?v7))
:effect (and  (pred_4 ?v13) (not (pred_2 ?v13))))


(:action op_5
:parameters (?v3 ?v12)
:precondition (and (pred_11 ?v3) (pred_11 ?v12)
               (pred_5 ?v3) (pred_10 ?v3 ?v12) (pred_4 ?v12))
:effect (and (pred_5 ?v12) (not (pred_5 ?v3))))

(:action op_1
:parameters (?v3 ?v7)
:precondition (and (pred_11 ?v3) (pred_9 ?v7) 
                  (pred_5 ?v3) (pred_6 ?v7 ?v3) (pred_12 ))
:effect (and (pred_7 ?v7)
   (not (pred_6 ?v7 ?v3)) (not (pred_12 ))))


(:action op_3
:parameters (?v3 ?v9 ?v5)
:precondition (and (pred_11 ?v3) (pred_9 ?v9) (pred_9 ?v5)
                  (pred_5 ?v3) (pred_7 ?v5) (pred_6 ?v9 ?v3))
:effect (and (pred_7 ?v9) (pred_6 ?v5 ?v3)
        (not (pred_7 ?v5)) (not (pred_6 ?v9 ?v3))))

(:action op_4
:parameters (?v3 ?v7)
:precondition (and (pred_11 ?v3) (pred_9 ?v7) 
                  (pred_5 ?v3) (pred_7 ?v7))
:effect (and (pred_12 ) (pred_6 ?v7 ?v3) (not (pred_7 ?v7)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_19 obj_07 obj_20 obj_06 obj_05 obj_02 obj_17 obj_04 obj_09 obj_12 obj_14 obj_10 obj_16 obj_13 obj_01 obj_15
    obj_18 obj_11
    obj_08 obj_03
    )

    (:init
       (pred_12)

       (pred_11 obj_19)
       (pred_11 obj_07)
       (pred_11 obj_20)
       (pred_11 obj_06)
       (pred_11 obj_05)
       (pred_11 obj_02)
       (pred_11 obj_17)
       (pred_11 obj_04)
       (pred_11 obj_09)
       (pred_11 obj_12)
       (pred_11 obj_14)
       (pred_11 obj_10)
       (pred_11 obj_16)
       (pred_11 obj_13)
       (pred_11 obj_01)
       (pred_11 obj_15)
       (pred_3 obj_18)
       (pred_3 obj_11)
       (pred_9 obj_08)
       (pred_9 obj_03)

       (pred_10 obj_19 obj_05)
       (pred_10 obj_19 obj_07)
       (pred_10 obj_07 obj_02)
       (pred_10 obj_07 obj_20)
       (pred_10 obj_07 obj_19)
       (pred_10 obj_20 obj_17)
       (pred_10 obj_20 obj_06)
       (pred_10 obj_20 obj_07)
       (pred_10 obj_06 obj_04)
       (pred_10 obj_06 obj_20)
       (pred_10 obj_05 obj_09)
       (pred_10 obj_05 obj_02)
       (pred_10 obj_05 obj_19)
       (pred_10 obj_02 obj_12)
       (pred_10 obj_02 obj_17)
       (pred_10 obj_02 obj_07)
       (pred_10 obj_02 obj_05)
       (pred_10 obj_17 obj_14)
       (pred_10 obj_17 obj_04)
       (pred_10 obj_17 obj_20)
       (pred_10 obj_17 obj_02)
       (pred_10 obj_04 obj_10)
       (pred_10 obj_04 obj_06)
       (pred_10 obj_04 obj_17)
       (pred_10 obj_09 obj_16)
       (pred_10 obj_09 obj_12)
       (pred_10 obj_09 obj_05)
       (pred_10 obj_12 obj_13)
       (pred_10 obj_12 obj_14)
       (pred_10 obj_12 obj_02)
       (pred_10 obj_12 obj_09)
       (pred_10 obj_14 obj_01)
       (pred_10 obj_14 obj_10)
       (pred_10 obj_14 obj_17)
       (pred_10 obj_14 obj_12)
       (pred_10 obj_10 obj_15)
       (pred_10 obj_10 obj_04)
       (pred_10 obj_10 obj_14)
       (pred_10 obj_16 obj_13)
       (pred_10 obj_16 obj_09)
       (pred_10 obj_13 obj_01)
       (pred_10 obj_13 obj_12)
       (pred_10 obj_13 obj_16)
       (pred_10 obj_01 obj_15)
       (pred_10 obj_01 obj_14)
       (pred_10 obj_01 obj_13)
       (pred_10 obj_15 obj_10)
       (pred_10 obj_15 obj_01)
       (pred_2 obj_04)
       (pred_2 obj_12)
       (pred_1  obj_04 obj_18)
       (pred_1  obj_12 obj_11)
       (pred_4 obj_19)
       (pred_4 obj_07)
       (pred_4 obj_20)
       (pred_4 obj_06)
       (pred_4 obj_05)
       (pred_4 obj_02)
       (pred_4 obj_17)
       (pred_4 obj_09)
       (pred_4 obj_14)
       (pred_4 obj_10)
       (pred_4 obj_16)
       (pred_4 obj_13)
       (pred_4 obj_01)
       (pred_4 obj_15)

       (pred_8  obj_08 obj_18)
       (pred_8  obj_03 obj_11)
       (pred_6 obj_08 obj_05)
       (pred_6 obj_03 obj_13)
       (pred_5 obj_20)
    )

    (:goal (and
       (pred_6 obj_03 obj_16)
    ))
(:constraints
  (always (not (pred_5 obj_14)))
)
)

; plan
1. (op_5 obj_20 obj_17)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_17)
   goals met: 0 of 1
2. (op_5 obj_17 obj_02)
   deleted: (pred_5 obj_17)
   added: (pred_5 obj_02)
   goals met: 0 of 1
3. (op_5 obj_02 obj_05)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_05)
   goals met: 0 of 1
4. (op_1 obj_05 obj_08)
   deleted: (pred_6 obj_08 obj_05) (pred_12)
   added: (pred_7 obj_08)
   goals met: 0 of 1
5. (op_5 obj_05 obj_09)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_09)
   goals met: 0 of 1
6. (op_5 obj_09 obj_16)
   deleted: (pred_5 obj_09)
   added: (pred_5 obj_16)
   goals met: 0 of 1
7. (op_4 obj_16 obj_08)
   deleted: (pred_7 obj_08)
   added: (pred_12) (pred_6 obj_08 obj_16)
   goals met: 0 of 1
8. (op_5 obj_16 obj_13)
   deleted: (pred_5 obj_16)
   added: (pred_5 obj_13)
   goals met: 0 of 1
9. (op_1 obj_13 obj_03)
   deleted: (pred_6 obj_03 obj_13) (pred_12)
   added: (pred_7 obj_03)
   goals met: 0 of 1
10. (op_5 obj_13 obj_16)
   deleted: (pred_5 obj_13)
   added: (pred_5 obj_16)
   goals met: 0 of 1
11. (op_3 obj_16 obj_08 obj_03)
   deleted: (pred_7 obj_03) (pred_6 obj_08 obj_16)
   added: (pred_7 obj_08) (pred_6 obj_03 obj_16)
   goals met: 1 of 1
